Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.131/PIC32CK-GC00/include/component/fcr.h
#define FCR_FFLTPTR_FLT1PTR_Pos               _UINT32_(0)                                          /* (FCR_FFLTPTR) Fault 1 Injection Pointer Position */
#define FCR_FFLTPTR_FLT1PTR_Msk               (_UINT32_(0x1FF) << FCR_FFLTPTR_FLT1PTR_Pos)         /* (FCR_FFLTPTR) Fault 1 Injection Pointer Mask */
#define FCR_FFLTPTR_FLT1PTR(value)            (FCR_FFLTPTR_FLT1PTR_Msk & (_UINT32_(value) << FCR_FFLTPTR_FLT1PTR_Pos)) /* Assigment of value for FLT1PTR in the FCR_FFLTPTR register */
#define FCR_FFLTPTR_FLT2PTR_Pos               _UINT32_(16)                                         /* (FCR_FFLTPTR) Fault 2 Injection Pointer Position */
#define FCR_FFLTPTR_FLT2PTR_Msk               (_UINT32_(0x1FF) << FCR_FFLTPTR_FLT2PTR_Pos)         /* (FCR_FFLTPTR) Fault 2 Injection Pointer Mask */
#define FCR_FFLTPTR_FLT2PTR(value)            (FCR_FFLTPTR_FLT2PTR_Msk & (_UINT32_(value) << FCR_FFLTPTR_FLT2PTR_Pos)) /* Assigment of value for FLT2PTR in the FCR_FFLTPTR register */
#define FCR_FFLTPTR_Msk                       _UINT32_(0x01FF01FF)                                 /* (FCR_FFLTPTR) Register Mask  */


/* -------- FCR_FFLTADR : (FCR Offset: 0x4C) (R/W 32) Flash Fault Address Register -------- */
#define FCR_FFLTADR_RESETVALUE                _UINT32_(0x00)                                       /*  (FCR_FFLTADR) Flash Fault Address Register  Reset Value */

#define FCR_FFLTADR_FLTADR_Pos                _UINT32_(0)                                          /* (FCR_FFLTADR) Fault Inject Mode - Physical Address Position */
#define FCR_FFLTADR_FLTADR_Msk                (_UINT32_(0xFFFFFFF) << FCR_FFLTADR_FLTADR_Pos)      /* (FCR_FFLTADR) Fault Inject Mode - Physical Address Mask */
#define FCR_FFLTADR_FLTADR(value)             (FCR_FFLTADR_FLTADR_Msk & (_UINT32_(value) << FCR_FFLTADR_FLTADR_Pos)) /* Assigment of value for FLTADR in the FCR_FFLTADR register */
#define FCR_FFLTADR_Msk                       _UINT32_(0x0FFFFFFF)                                 /* (FCR_FFLTADR) Register Mask  */


/* -------- FCR_FFLTCAP : (FCR Offset: 0x50) ( R/ 32) Flash Fault Capture Address Register -------- */
#define FCR_FFLTCAP_RESETVALUE                _UINT32_(0x00)                                       /*  (FCR_FFLTCAP) Flash Fault Capture Address Register  Reset Value */

#define FCR_FFLTCAP_FLTADR_Pos                _UINT32_(0)                                          /* (FCR_FFLTCAP) Fault capture Mode - Physical Address Position */
#define FCR_FFLTCAP_FLTADR_Msk                (_UINT32_(0xFFFFFFF) << FCR_FFLTCAP_FLTADR_Pos)      /* (FCR_FFLTCAP) Fault capture Mode - Physical Address Mask */
#define FCR_FFLTCAP_FLTADR(value)             (FCR_FFLTCAP_FLTADR_Msk & (_UINT32_(value) << FCR_FFLTCAP_FLTADR_Pos)) /* Assigment of value for FLTADR in the FCR_FFLTCAP register */
#define FCR_FFLTCAP_Msk                       _UINT32_(0x0FFFFFFF)                                 /* (FCR_FFLTCAP) Register Mask  */


/* -------- FCR_FFLTPAR : (FCR Offset: 0x54) ( R/ 32) Flash ECC Fault Parity Register -------- */
#define FCR_FFLTPAR_RESETVALUE                _UINT32_(0x00)                                       /*  (FCR_FFLTPAR) Flash ECC Fault Parity Register  Reset Value */

#define FCR_FFLTPAR_SECIN_Pos                 _UINT32_(0)                                          /* (FCR_FFLTPAR) The Single Error Parity bits from Flash Position */
#define FCR_FFLTPAR_SECIN_Msk                 (_UINT32_(0x1FF) << FCR_FFLTPAR_SECIN_Pos)           /* (FCR_FFLTPAR) The Single Error Parity bits from Flash Mask */
#define FCR_FFLTPAR_SECIN(value)              (FCR_FFLTPAR_SECIN_Msk & (_UINT32_(value) << FCR_FFLTPAR_SECIN_Pos)) /* Assigment of value for SECIN in the FCR_FFLTPAR register */
#define FCR_FFLTPAR_DEDIN_Pos                 _UINT32_(15)                                         /* (FCR_FFLTPAR) The Overall Parity from Flash Position */
#define FCR_FFLTPAR_DEDIN_Msk                 (_UINT32_(0x1) << FCR_FFLTPAR_DEDIN_Pos)             /* (FCR_FFLTPAR) The Overall Parity from Flash Mask */
#define FCR_FFLTPAR_DEDIN(value)              (FCR_FFLTPAR_DEDIN_Msk & (_UINT32_(value) << FCR_FFLTPAR_DEDIN_Pos)) /* Assigment of value for DEDIN in the FCR_FFLTPAR register */
#define FCR_FFLTPAR_SECOUT_Pos                _UINT32_(16)                                         /* (FCR_FFLTPAR) The Calculated Single Error Parity bits Position */
#define FCR_FFLTPAR_SECOUT_Msk                (_UINT32_(0x1FF) << FCR_FFLTPAR_SECOUT_Pos)          /* (FCR_FFLTPAR) The Calculated Single Error Parity bits Mask */
#define FCR_FFLTPAR_SECOUT(value)             (FCR_FFLTPAR_SECOUT_Msk & (_UINT32_(value) << FCR_FFLTPAR_SECOUT_Pos)) /* Assigment of value for SECOUT in the FCR_FFLTPAR register */
#define FCR_FFLTPAR_DEDOUT_Pos                _UINT32_(31)                                         /* (FCR_FFLTPAR) The Calculated Overall Parity used in Double Error Detection Position */
#define FCR_FFLTPAR_DEDOUT_Msk                (_UINT32_(0x1) << FCR_FFLTPAR_DEDOUT_Pos)            /* (FCR_FFLTPAR) The Calculated Overall Parity used in Double Error Detection Mask */
#define FCR_FFLTPAR_DEDOUT(value)             (FCR_FFLTPAR_DEDOUT_Msk & (_UINT32_(value) << FCR_FFLTPAR_DEDOUT_Pos)) /* Assigment of value for DEDOUT in the FCR_FFLTPAR register */
#define FCR_FFLTPAR_Msk                       _UINT32_(0x81FF81FF)                                 /* (FCR_FFLTPAR) Register Mask  */


/* -------- FCR_FFLTSYN : (FCR Offset: 0x58) ( R/ 32) Flash ECC Fault Syndrome Register -------- */
#define FCR_FFLTSYN_RESETVALUE                _UINT32_(0x00)                                       /*  (FCR_FFLTSYN) Flash ECC Fault Syndrome Register  Reset Value */

#define FCR_FFLTSYN_SECSYN_Pos                _UINT32_(0)                                          /* (FCR_FFLTSYN) Single Error Correction Syndrome Position */
#define FCR_FFLTSYN_SECSYN_Msk                (_UINT32_(0x1FF) << FCR_FFLTSYN_SECSYN_Pos)          /* (FCR_FFLTSYN) Single Error Correction Syndrome Mask */
#define FCR_FFLTSYN_SECSYN(value)             (FCR_FFLTSYN_SECSYN_Msk & (_UINT32_(value) << FCR_FFLTSYN_SECSYN_Pos)) /* Assigment of value for SECSYN in the FCR_FFLTSYN register */
#define FCR_FFLTSYN_DEDSYN_Pos                _UINT32_(15)                                         /* (FCR_FFLTSYN) DED Syndrome Position */
#define FCR_FFLTSYN_DEDSYN_Msk                (_UINT32_(0x1) << FCR_FFLTSYN_DEDSYN_Pos)            /* (FCR_FFLTSYN) DED Syndrome Mask */
#define FCR_FFLTSYN_DEDSYN(value)             (FCR_FFLTSYN_DEDSYN_Msk & (_UINT32_(value) << FCR_FFLTSYN_DEDSYN_Pos)) /* Assigment of value for DEDSYN in the FCR_FFLTSYN register */
#define FCR_FFLTSYN_DERR_Pos                  _UINT32_(16)                                         /* (FCR_FFLTSYN) Double Error Detected & Single Error Corrected Position */
#define FCR_FFLTSYN_DERR_Msk                  (_UINT32_(0x3) << FCR_FFLTSYN_DERR_Pos)              /* (FCR_FFLTSYN) Double Error Detected & Single Error Corrected Mask */
#define FCR_FFLTSYN_DERR(value)               (FCR_FFLTSYN_DERR_Msk & (_UINT32_(value) << FCR_FFLTSYN_DERR_Pos)) /* Assigment of value for DERR in the FCR_FFLTSYN register */
#define FCR_FFLTSYN_CERR_Pos                  _UINT32_(18)                                         /* (FCR_FFLTSYN) ECC Control bit Error Position */
#define FCR_FFLTSYN_CERR_Msk                  (_UINT32_(0x1) << FCR_FFLTSYN_CERR_Pos)              /* (FCR_FFLTSYN) ECC Control bit Error Mask */
#define FCR_FFLTSYN_CERR(value)               (FCR_FFLTSYN_CERR_Msk & (_UINT32_(value) << FCR_FFLTSYN_CERR_Pos)) /* Assigment of value for CERR in the FCR_FFLTSYN register */
#define FCR_FFLTSYN_CTLSTAT_Pos               _UINT32_(24)                                         /* (FCR_FFLTSYN) Parity vs ECC Control Status Position */
#define FCR_FFLTSYN_CTLSTAT_Msk               (_UINT32_(0x7) << FCR_FFLTSYN_CTLSTAT_Pos)           /* (FCR_FFLTSYN) Parity vs ECC Control Status Mask */
#define FCR_FFLTSYN_CTLSTAT(value)            (FCR_FFLTSYN_CTLSTAT_Msk & (_UINT32_(value) << FCR_FFLTSYN_CTLSTAT_Pos)) /* Assigment of value for CTLSTAT in the FCR_FFLTSYN register */
#define FCR_FFLTSYN_PERR_Pos                  _UINT32_(27)                                         /* (FCR_FFLTSYN) Per Word Parity Error Status Position */
#define FCR_FFLTSYN_PERR_Msk                  (_UINT32_(0x1F) << FCR_FFLTSYN_PERR_Pos)             /* (FCR_FFLTSYN) Per Word Parity Error Status Mask */
#define FCR_FFLTSYN_PERR(value)               (FCR_FFLTSYN_PERR_Msk & (_UINT32_(value) << FCR_FFLTSYN_PERR_Pos)) /* Assigment of value for PERR in the FCR_FFLTSYN register */
#define FCR_FFLTSYN_Msk                       _UINT32_(0xFF0781FF)                                 /* (FCR_FFLTSYN) Register Mask  */


/* -------- FCR_CRP : (FCR Offset: 0x5C) (R/W 32) CFM Page Read Protect Register -------- */
#define FCR_CRP_RESETVALUE                    _UINT32_(0x00)                                       /*  (FCR_CRP) CFM Page Read Protect Register  Reset Value */

#define FCR_CRP_BC1RP_Pos                     _UINT32_(2)                                          /* (FCR_CRP) Boot Configuration Page 1 Read Protect Bit Position */
#define FCR_CRP_BC1RP_Msk                     (_UINT32_(0x1) << FCR_CRP_BC1RP_Pos)                 /* (FCR_CRP) Boot Configuration Page 1 Read Protect Bit Mask */
#define FCR_CRP_BC1RP(value)                  (FCR_CRP_BC1RP_Msk & (_UINT32_(value) << FCR_CRP_BC1RP_Pos)) /* Assigment of value for BC1RP in the FCR_CRP register */
#define FCR_CRP_BC2RP_Pos                     _UINT32_(10)                                         /* (FCR_CRP) Boot Configuration Page 2 Read Protect Bit Position */
#define FCR_CRP_BC2RP_Msk                     (_UINT32_(0x1) << FCR_CRP_BC2RP_Pos)                 /* (FCR_CRP) Boot Configuration Page 2 Read Protect Bit Mask */
#define FCR_CRP_BC2RP(value)                  (FCR_CRP_BC2RP_Msk & (_UINT32_(value) << FCR_CRP_BC2RP_Pos)) /* Assigment of value for BC2RP in the FCR_CRP register */
#define FCR_CRP_BC1RPLOCK_Pos                 _UINT32_(18)                                         /* (FCR_CRP) Boot Configuration Page 1 RP Lock Bit Position */
#define FCR_CRP_BC1RPLOCK_Msk                 (_UINT32_(0x1) << FCR_CRP_BC1RPLOCK_Pos)             /* (FCR_CRP) Boot Configuration Page 1 RP Lock Bit Mask */
#define FCR_CRP_BC1RPLOCK(value)              (FCR_CRP_BC1RPLOCK_Msk & (_UINT32_(value) << FCR_CRP_BC1RPLOCK_Pos)) /* Assigment of value for BC1RPLOCK in the FCR_CRP register */
#define FCR_CRP_BC2RPLOCK_Pos                 _UINT32_(26)                                         /* (FCR_CRP) Boot Configuration Page 2 RP Lock Bit Position */
#define FCR_CRP_BC2RPLOCK_Msk                 (_UINT32_(0x1) << FCR_CRP_BC2RPLOCK_Pos)             /* (FCR_CRP) Boot Configuration Page 2 RP Lock Bit Mask */
#define FCR_CRP_BC2RPLOCK(value)              (FCR_CRP_BC2RPLOCK_Msk & (_UINT32_(value) << FCR_CRP_BC2RPLOCK_Pos)) /* Assigment of value for BC2RPLOCK in the FCR_CRP register */
#define FCR_CRP_Msk                           _UINT32_(0x04040404)                                 /* (FCR_CRP) Register Mask  */


