Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.131/PIC32CK-GC00/include/component/fcr.h
/* -------- FCR_HSMCTRL : (FCR Offset: 0x60) (R/W 32) HSM CFM PAGES Control Register -------- */
#define FCR_HSMCTRL_RESETVALUE                _UINT32_(0x00)                                       /*  (FCR_HSMCTRL) HSM CFM PAGES Control Register  Reset Value */

#define FCR_HSMCTRL_ECCDIS_Pos                _UINT32_(0)                                          /* (FCR_HSMCTRL) ECC Disable for HSM Pages in CFM Position */
#define FCR_HSMCTRL_ECCDIS_Msk                (_UINT32_(0x1) << FCR_HSMCTRL_ECCDIS_Pos)            /* (FCR_HSMCTRL) ECC Disable for HSM Pages in CFM Mask */
#define FCR_HSMCTRL_ECCDIS(value)             (FCR_HSMCTRL_ECCDIS_Msk & (_UINT32_(value) << FCR_HSMCTRL_ECCDIS_Pos)) /* Assigment of value for ECCDIS in the FCR_HSMCTRL register */
#define FCR_HSMCTRL_KEYZ_Pos                  _UINT32_(1)                                          /* (FCR_HSMCTRL) Flash Key Locations read 0\xd5 s Position */
#define FCR_HSMCTRL_KEYZ_Msk                  (_UINT32_(0x1) << FCR_HSMCTRL_KEYZ_Pos)              /* (FCR_HSMCTRL) Flash Key Locations read 0\xd5 s Mask */
#define FCR_HSMCTRL_KEYZ(value)               (FCR_HSMCTRL_KEYZ_Msk & (_UINT32_(value) << FCR_HSMCTRL_KEYZ_Pos)) /* Assigment of value for KEYZ in the FCR_HSMCTRL register */
#define FCR_HSMCTRL_Msk                       _UINT32_(0x00000003)                                 /* (FCR_HSMCTRL) Register Mask  */


/** \brief FCR register offsets definitions */
#define FCR_CTRLA_REG_OFST             _UINT32_(0x00)      /* (FCR_CTRLA) Control A Register Offset */
#define FCR_CTRLB_REG_OFST             _UINT32_(0x04)      /* (FCR_CTRLB) Control B Register Offset */
#define FCR_INTENCLR_REG_OFST          _UINT32_(0x08)      /* (FCR_INTENCLR) Interrupt Enable Clear Register Offset */
#define FCR_INTENSET_REG_OFST          _UINT32_(0x0C)      /* (FCR_INTENSET) Interrupt Enable SET Register Offset */
#define FCR_INTFLAG_REG_OFST           _UINT32_(0x10)      /* (FCR_INTFLAG) Interrupt Flag Register Offset */
#define FCR_STATUS_REG_OFST            _UINT32_(0x14)      /* (FCR_STATUS) NVM Status Register Offset */
#define FCR_DBGCTRL_REG_OFST           _UINT32_(0x18)      /* (FCR_DBGCTRL) Debug Control Register Offset */
#define FCR_ECCCTRL_REG_OFST           _UINT32_(0x1C)      /* (FCR_ECCCTRL) ECC Control Register Offset */
#define FCR_CRCCTRL_REG_OFST           _UINT32_(0x20)      /* (FCR_CRCCTRL) CRC Control Register Offset */
#define FCR_CRCPAUSE_REG_OFST          _UINT32_(0x24)      /* (FCR_CRCPAUSE) CRC PAUSE Register Offset */
#define FCR_CRCMADR_REG_OFST           _UINT32_(0x28)      /* (FCR_CRCMADR) CRC Message Address Register Offset */
#define FCR_CRCMLEN_REG_OFST           _UINT32_(0x2C)      /* (FCR_CRCMLEN) CRC Message Length Register Offset */
#define FCR_CRCIV_REG_OFST             _UINT32_(0x30)      /* (FCR_CRCIV) CRC Initial Value Register Offset */
#define FCR_CRCACC_REG_OFST            _UINT32_(0x34)      /* (FCR_CRCACC) CRC Accumulator Register Offset */
#define FCR_CRCPOLY_REG_OFST           _UINT32_(0x38)      /* (FCR_CRCPOLY) CRC Polynomial Register Offset */
#define FCR_CRCFXOR_REG_OFST           _UINT32_(0x3C)      /* (FCR_CRCFXOR) CRC Final XOR Register Offset */
#define FCR_CRCSUM_REG_OFST            _UINT32_(0x40)      /* (FCR_CRCSUM) CRC Checksum Register Offset */
#define FCR_FFLTCTRL_REG_OFST          _UINT32_(0x44)      /* (FCR_FFLTCTRL) Flash ECC Fault Control Register Offset */
#define FCR_FFLTPTR_REG_OFST           _UINT32_(0x48)      /* (FCR_FFLTPTR) Flash ECC Fault Pointer Register Offset */
#define FCR_FFLTADR_REG_OFST           _UINT32_(0x4C)      /* (FCR_FFLTADR) Flash Fault Address Register Offset */
#define FCR_FFLTCAP_REG_OFST           _UINT32_(0x50)      /* (FCR_FFLTCAP) Flash Fault Capture Address Register Offset */
#define FCR_FFLTPAR_REG_OFST           _UINT32_(0x54)      /* (FCR_FFLTPAR) Flash ECC Fault Parity Register Offset */
#define FCR_FFLTSYN_REG_OFST           _UINT32_(0x58)      /* (FCR_FFLTSYN) Flash ECC Fault Syndrome Register Offset */
#define FCR_CRP_REG_OFST               _UINT32_(0x5C)      /* (FCR_CRP) CFM Page Read Protect Register Offset */
#define FCR_HSMCTRL_REG_OFST           _UINT32_(0x60)      /* (FCR_HSMCTRL) HSM CFM PAGES Control Register Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief FCR register API structure */
typedef struct
{  /* Flash Read Controller (FCR) */
  __IO  uint32_t                       FCR_CTRLA;          /**< Offset: 0x00 (R/W  32) Control A Register */
  __IO  uint32_t                       FCR_CTRLB;          /**< Offset: 0x04 (R/W  32) Control B Register */
  __IO  uint32_t                       FCR_INTENCLR;       /**< Offset: 0x08 (R/W  32) Interrupt Enable Clear Register */
  __IO  uint32_t                       FCR_INTENSET;       /**< Offset: 0x0C (R/W  32) Interrupt Enable SET Register */
  __IO  uint32_t                       FCR_INTFLAG;        /**< Offset: 0x10 (R/W  32) Interrupt Flag Register */
  __I   uint32_t                       FCR_STATUS;         /**< Offset: 0x14 (R/   32) NVM Status Register */
  __IO  uint32_t                       FCR_DBGCTRL;        /**< Offset: 0x18 (R/W  32) Debug Control Register */
  __IO  uint32_t                       FCR_ECCCTRL;        /**< Offset: 0x1C (R/W  32) ECC Control Register */
  __IO  uint32_t                       FCR_CRCCTRL;        /**< Offset: 0x20 (R/W  32) CRC Control Register */
  __IO  uint32_t                       FCR_CRCPAUSE;       /**< Offset: 0x24 (R/W  32) CRC PAUSE Register */
  __IO  uint32_t                       FCR_CRCMADR;        /**< Offset: 0x28 (R/W  32) CRC Message Address Register */
  __IO  uint32_t                       FCR_CRCMLEN;        /**< Offset: 0x2C (R/W  32) CRC Message Length Register */
  __IO  uint32_t                       FCR_CRCIV;          /**< Offset: 0x30 (R/W  32) CRC Initial Value Register */
  __I   uint32_t                       FCR_CRCACC;         /**< Offset: 0x34 (R/   32) CRC Accumulator Register */
  __IO  uint32_t                       FCR_CRCPOLY;        /**< Offset: 0x38 (R/W  32) CRC Polynomial Register */
  __IO  uint32_t                       FCR_CRCFXOR;        /**< Offset: 0x3C (R/W  32) CRC Final XOR Register */
  __IO  uint32_t                       FCR_CRCSUM;         /**< Offset: 0x40 (R/W  32) CRC Checksum Register */
  __IO  uint32_t                       FCR_FFLTCTRL;       /**< Offset: 0x44 (R/W  32) Flash ECC Fault Control Register */
  __IO  uint32_t                       FCR_FFLTPTR;        /**< Offset: 0x48 (R/W  32) Flash ECC Fault Pointer Register */
  __IO  uint32_t                       FCR_FFLTADR;        /**< Offset: 0x4C (R/W  32) Flash Fault Address Register */
  __I   uint32_t                       FCR_FFLTCAP;        /**< Offset: 0x50 (R/   32) Flash Fault Capture Address Register */
  __I   uint32_t                       FCR_FFLTPAR;        /**< Offset: 0x54 (R/   32) Flash ECC Fault Parity Register */
  __I   uint32_t                       FCR_FFLTSYN;        /**< Offset: 0x58 (R/   32) Flash ECC Fault Syndrome Register */
  __IO  uint32_t                       FCR_CRP;            /**< Offset: 0x5C (R/W  32) CFM Page Read Protect Register */
  __IO  uint32_t                       FCR_HSMCTRL;        /**< Offset: 0x60 (R/W  32) HSM CFM PAGES Control Register */
} fcr_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CKGC00_FCR_COMPONENT_H_ */
